[SNHeavyBarrel_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Heavy Barrel"
FriendlyNamePlural="Heavy Barrels"
BriefSummary="Increases critical hit damage bonus by <Ability:SNHEAVYBARRELT1DMG/>."
TinySummary="Increased critical hit damage"
LootTooltip="This weapon upgrade, when installed, adds a slight bonus to damage dealt on critical hits."

[SNHeavyBarrel_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Heavy Barrel"
FriendlyNamePlural="Advanced Heavy Barrels"
BriefSummary="Increases critical hit damage bonus by <Ability:SNHEAVYBARRELT2DMG/>."
TinySummary="Increased critical hit damage"
LootTooltip="This weapon upgrade, when installed, adds a moderate bonus to damage dealt on critical hits."

[SNHeavyBarrel_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Heavy Barrel"
FriendlyNamePlural="Superior Heavy Barrels"
BriefSummary="Increases critical hit damage bonus by <Ability:SNHEAVYBARRELT3DMG/>."
TinySummary="Increased critical hit damage"
LootTooltip="This weapon upgrade, when installed, adds a significant bonus to damage dealt on critical hits."

